---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctSizeIterator.GetCurrent
source: html/a9b33b14-5bdd-cdf1-4964-47014ec49703.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizeIterator.GetCurrent Method

Returns the current MEPSize.

## Syntax (C#)
```csharp
public MEPSize GetCurrent()
```

## Returns
The current MEPSize.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - There is no current item in the iterator.